package com.kenny.craftix.client.language.localization;

import static com.kenny.craftix.client.language.Language.*;

import com.kenny.craftix.client.Craftix;

public class LocRu 
{
	public void loadRuLocalization()
	{
		INFO_CRAFTIX = "Название движка: " + Craftix.TITLE;
		INFO_ENGINE_VER = "Версия: " + Craftix.VERSION;
		INFO_VERSION_TYPE = "Тип Версии: ";
		INFO_USERNAME = "Никнейм: ";
		INFO_USER_ID = "Пользователя Id: ";
		INFO_SESSION_ID = "Сессии Id: ";
		URI_TITLE = "Переход по Ссылке: ";
		CONTINUE = "Продолжить";
		COMPANY = "Кенни Компания@";
		PLAY = "";
		SINGLEPLAYER = "Одиночная Игра";
		MULTIPLAYER = "Сетевая Игра";
		OPTIONS = "Настройки";
		CREDITS = "Авторы";
		BACK = "Назад";
		LATEST_UPDATES_TITLE = "Обновления";
		UPDATES_VERSION = "Лог Версий: 0.0.12 - 0.0.15b (Кратко)";
		UPDATES_LOG_DESC = 
				"- Добавлен файл конфигурации. Файл находиться в '.craftix'      " + 
				"- Добавлена локализация в игру, есть русский и английский.      " +
				"- Добавлено больше вкладок в опции такие как: 'Звук', 'Графика'," + 
				"'Язык', и так-же новые настройки.                                      " + 
				"- Теперь все настройки которые вы выберите сохраняться.         " + 
				"- Исправлен баг: при нажатии на крестик игра кряшилась.           " +
				"- Из игрвой сцены теперь можно попасть в меню движка.           " +
				"- В игре с помошью кнопок можно переключать камеры игрока.                         " +
				"                                                                                   " +
				"- Добавлена система аудио (звука) в игру. Звук кнопока добавлен," +
				"музыка в главном меню и в игрвой сцене.";
		ENGINE_INFO_TITLE =  "Информация об движке Craftix";
		FILE_CONFIG_ERROR = "Файл конфигурации не загружен!";
		FULLSCREEN = "Полный Экран:";
		FBO = "Фрейм Буффер:";
		R_SKYBOX = "Рендер Неба:";
		R_WATER = "Рендер Воды:";
		TRIANGLE_MODE = "Треугольный Мод:";
		SOON_AUDIO = "Скоро Настройки Аудио!";
		CREDITS_AUTOR = "Этот игровой движок был создан Кении(Данил Духовенко) и Компанией Кенни@. Данный движок находится на очень ранней стадии разработки, поэтому ждать от него чего-то сверхъестественного я думаю не стоит. Если кто-то захочет помочь проекту, я буду очень признателен. И все они появиться на этой странице.";
		GEN_WORLD = "Создать Мир";
		GEN_LP_WORLD = "Создать Лоу-Поли Мир";
		GEN_F_WORLD = "Создать Плоский Мир";
		GEN_E_WORLD = "Создать Пустой Мир";
		LOADING_WORLD = "Загрузка Мир";
		LOADING_WORLD_GEN_TERRIAN = "Генерация Ландшафта...";
		LOADING_WORLD_PROC_ENTITY = "Отрисовка Обьектов...";
		RESUME = "Возобновить";
		SAVE_WORLD = "Сохранить Мир";
		LOAD_WORLD = "Загрузить Мир";
		BACK_MENU = "В Главное Меню";
		EXIT = "Выйти";
		EXIT_GAME = "Выйти из Игры";
		QUIT_GAME = "Выйти из Игры";
		GRAPHICS = "Графика";
		GUI_SCALE = "Размер Gui:";
		AUDIO = "Звук";
		LANGUAGE = "Язык";
		LANG_DESC = "Выберите нужный вам язык:";
		LANG_EN = "Английский";
		LANG_RU = "Русский";
		OPTION_CHANGE_DESC = "Чтоб все изменения сохранились, перезагрузите игру.";
		RESOLUTION = "Разрешение Экрана:";
		SCREEN_1600x900 = "1600x900";
		SCREEN_1280x720 = "1280x720";
		SCREEN_1200x600 = "1200x600";
		SCREEN_640x540 = "640x540";
		AUDIO_ON_OFF = "Вкл/Выкл Звук: ";
		QUIT_GAME_DESC = "Вы действительно хотите выйти из игры?";
		RETURN = "Вернуться";
		RESPAWN = "Возрадиться";
		GL_ERROR_1 = "Не поддерживаються шейдеры! Обновите OpenGl или драйвера карты.";
		GL_ERROR_2 = "Не поддерживаеться '400 core' версия шейдеров!";
		GL_ERROR_3 = "Устаревшая версия OpenGL. Необходимо 3.0 +.";
		GL_ERROR_4 = "";
		GL_ERROR_5 = "";
		
	}
}
